{
  "settings": {
    "maxAgeDays": 364
  },
  "posts": [
    {
      "id": "79407e21-6063-4d90-9d64-20299cda582b",
      "createdAt": 1767209684316,
      "blocks": [
        {
          "type": "text",
          "text": "Welcome! Site is under construction."
        }
      ],
      "sticky": true,
      "stickyPosition": 1
    },
    {
      "id": "988f8457-d6f3-4573-8ac6-4fc691233c15",
      "createdAt": 1770745952890,
      "sticky": false,
      "stickyPosition": null,
      "blocks": [
        {
          "type": "text",
          "text": "I know I am slow, sorry about that, there are some real life complications. I will continue work on it when I get the chance. There is good news though, the Vuplex browser now routs audio through Unity so there is Unity audio components available like echo and stuff. I have implemented a better menu and UI.",
          "rich": true
        }
      ]
    },
    {
      "id": "9e040e61-bde5-4776-bc25-2be002445cbd",
      "createdAt": 1769055807428,
      "sticky": false,
      "stickyPosition": 2,
      "blocks": [
        {
          "type": "text",
          "text": "If the quit menu is not working, it's not a hack its just a underlying bug. You will have to use task manager (Alt F4 might work on it) to close it if that happens. The music may continue to play for a min (seems to auto close after a min or so) after that or until you close the Vuplex task manager process (this is the built in browser). I am trying to figure out a fix.<br><br>Update: I have the fix and fix for the overnight bug listed in the readme also. I am going through a rewrite, should be out in a few days.<br><br>Update two: I put up a fixed version. Changing hotkeys broke for now. There is static global hotkeys. Play/Pause is Alt, Shift, F10. Next Song is Alt, Shift, F11. Previous Song is Alt, Shift, F12.",
          "rich": true
        }
      ]
    },
    {
      "id": "44f500ce-ebc2-498f-a103-717dc49c0d57",
      "createdAt": 1767921258845,
      "sticky": false,
      "stickyPosition": null,
      "blocks": [
        {
          "type": "text",
          "text": "Fixed a bug with the second browser window not stopping its videos when top right clicked.",
          "rich": true
        }
      ]
    },
    {
      "id": "c36e3d31-9d72-4591-afa4-4c44f64b17db",
      "createdAt": 1767639679615,
      "sticky": false,
      "stickyPosition": null,
      "blocks": [
        {
          "type": "text",
          "text": "Small update with a fix for when the window changes size from some outside code. Same download link.",
          "rich": true
        }
      ]
    }
  ]
}